docs/ArchitectureDesign.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-25 Sat 12:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="HongpengMa" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf47c8db">1. Hi-C View Architecture Design</a></li>
<li><a href="#orge2c6938">2. Concepts</a>
<ul>
<li><a href="#org967d34f">2.1. Components &amp; Stage</a></li>
<li><a href="#orgfc22c63">2.2. State Arrays</a></li>
<li><a href="#orga6d2e64">2.3. Entries &amp; Pipelines</a></li>
<li><a href="#org1b51e5e">2.4. Element Rendering</a></li>
<li><a href="#org9c0a005">2.5. Life Cycles</a>
<ul>
<li><a href="#org60cd804">2.5.1. Components Life Cycles (Components live in stages)</a></li>
<li><a href="#org69a0020">2.5.2. Stage Life Cycles</a></li>
</ul>
</li>
<li><a href="#orge5718ca">2.6. Event Handling</a></li>
<li><a href="#orge55992c">2.7. Kit</a></li>
</ul>
</li>
<li><a href="#org7f3686f">3. Principles</a>
<ul>
<li><a href="#org0854d86">3.1. Data flow is single direction</a></li>
<li><a href="#orgdcdc01c">3.2. Pipelines modified data flow</a></li>
<li><a href="#org61b13ac">3.3. Stage has a single state</a></li>
<li><a href="#orge74cadd">3.4. Stage only control how to render data, not control HTML/CSS staff</a></li>
</ul>
</li>
<li><a href="#org0f8cd2a">4. Design Documentation</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf47c8db" class="outline-2">
<h2 id="orgf47c8db"><span class="section-number-2">1</span> Hi-C View Architecture Design</h2>
</div>


<div id="outline-container-orge2c6938" class="outline-2">
<h2 id="orge2c6938"><span class="section-number-2">2</span> Concepts</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org967d34f" class="outline-3">
<h3 id="org967d34f"><span class="section-number-3">2.1</span> Components &amp; Stage</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Components are the basic elements in Hi-C View framework. Components has two types: data-type and view-type. Data-type stores biological data. View-type transform data-type components to what can be loaded to stage and visualize.
</p>

<p>
Stages are what researchers view and interact with. It could render different type of stages and can load components of both data-type and view-type.
</p>
</div>
</div>


<div id="outline-container-orgfc22c63" class="outline-3">
<h3 id="orgfc22c63"><span class="section-number-3">2.2</span> State Arrays</h3>
<div class="outline-text-3" id="text-2-2">
<p>
State Arrays is stores different stages &amp; components state. Shifting from a timestamp to another is the changing state of available stagee.
</p>

<p>
TS: timestamp
</p>

<p>
TS 1        TS 2       TS 3        TS 4 
</p>

<p>
-------------------------------------------------------&#x2013;&#x2014;&gt;
</p>

<p>
\ | ----&#x2013;&#x2014;&gt; |
</p>

<p>
StateShiftTimeStamp(src<sub>ts</sub>, dest<sub>ts</sub>)
</p>

<p>
State Arrays could represent different states at the same time or represent a time series sequence.
</p>
</div>
</div>

<div id="outline-container-orga6d2e64" class="outline-3">
<h3 id="orga6d2e64"><span class="section-number-3">2.3</span> Entries &amp; Pipelines</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Pipelines deal with the data flow. It can modified data format, merge data from different sources, compare different data and do the calculation.
</p>

<p>
A brief image:
</p>

<p>
Entry Data 1 &#x2014;
</p>

<p>
\
</p>

<p>
Entry Data 2 &#x2013;&#x2014;\                                                                                |Under Stage|
</p>

<p>
-&#x2014;&gt; Pipeline &#x2014;&gt; Processed Data &#x2013;&gt; State Arrays &#x2013;&gt; d-type Components &#x2013;&gt;  v-type Components &#x2013;&gt; Stages &#x2013;&gt; Visualization
</p>

<p>
Entry Data 3 &#x2013;&#x2014;/
</p>

<p>
/
</p>

<p>
&#x2026;.   ---&#x2013;&#x2014;
</p>
</div>
</div>

<div id="outline-container-org1b51e5e" class="outline-3">
<h3 id="org1b51e5e"><span class="section-number-3">2.4</span> Element Rendering</h3>
</div>


<div id="outline-container-org9c0a005" class="outline-3">
<h3 id="org9c0a005"><span class="section-number-3">2.5</span> Life Cycles</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org60cd804" class="outline-4">
<h4 id="org60cd804"><span class="section-number-4">2.5.1</span> Components Life Cycles (Components live in stages)</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
\            |         Render phase (No side effect) |  Commit phase (update DOM)
</p>

<p>
			    -----&#x2013;&#x2014;      ---&#x2013;&#x2014;     ----&#x2013;&#x2014;
 Mounting -&gt; constructor -&gt; | Get    |  &#x2013;&gt; |      | &#x2013;&gt; |       | &#x2013;&gt; ComponentDidMountToStage
\                           | Derived|      |Render|     | Update|
\                           | State  |      |      |     | DOM   |
\                           | From   |      |      |     |       |
 Updating -&gt; props, state,-&gt;| Props  |  &#x2013;&gt; |      | &#x2013;&gt; |       | &#x2013;&gt; ComponentDidUpdateInStage
	     force update   |        |      |      |     |       |
\                           |---&#x2013;&#x2014;|      |-&#x2013;&#x2014;|     |--&#x2013;&#x2014;|
</p>

<p>
Unmounting  ---------------------------------------------------&#x2013;&#x2014;&gt; ComponentWillUnmountFromStage
</p>
</div>
</div>

<div id="outline-container-org69a0020" class="outline-4">
<h4 id="org69a0020"><span class="section-number-4">2.5.2</span> Stage Life Cycles</h4>
<div class="outline-text-4" id="text-2-5-2">
<p>
 Initialize -&gt; constructor -&gt;|--&#x2013;&#x2014;|  -&gt;  |--&#x2013;&#x2014;| -&gt;  StageDidInitialize   
\                            |Get    |      |Animate|    
\                            |State  |      |       |    
 Updating   -&gt; components, -&gt;|       |  -&gt;  |       | -&gt;  StageDidUpdate  
	       state,        |       |      |       |    
	       force update  |--&#x2013;&#x2014;|      |--&#x2013;&#x2014;|    
</p>

<p>
Disposing  --------------------------------------&#x2013;&#x2014;&gt; StageWillDispose
</p>
</div>
</div>
</div>

<div id="outline-container-orge5718ca" class="outline-3">
<h3 id="orge5718ca"><span class="section-number-3">2.6</span> Event Handling</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Event Handling is handled by eventEngine, 
</p>
</div>
</div>




<div id="outline-container-orge55992c" class="outline-3">
<h3 id="orge55992c"><span class="section-number-3">2.7</span> Kit</h3>
<div class="outline-text-3" id="text-2-7">
<p>
A kit is a collection of different stages. For example, if you get 1D, 2D and 3D stages, and you want to reuse this collection in other project or analysis. You could simply create a new kit to reuse it.
</p>
</div>
</div>
</div>


<div id="outline-container-org7f3686f" class="outline-2">
<h2 id="org7f3686f"><span class="section-number-2">3</span> Principles</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0854d86" class="outline-3">
<h3 id="org0854d86"><span class="section-number-3">3.1</span> Data flow is single direction</h3>
</div>

<div id="outline-container-orgdcdc01c" class="outline-3">
<h3 id="orgdcdc01c"><span class="section-number-3">3.2</span> Pipelines modified data flow</h3>
</div>

<div id="outline-container-org61b13ac" class="outline-3">
<h3 id="org61b13ac"><span class="section-number-3">3.3</span> Stage has a single state</h3>
</div>

<div id="outline-container-orge74cadd" class="outline-3">
<h3 id="orge74cadd"><span class="section-number-3">3.4</span> Stage only control how to render data, not control HTML/CSS staff</h3>
</div>
</div>


<div id="outline-container-org0f8cd2a" class="outline-2">
<h2 id="org0f8cd2a"><span class="section-number-2">4</span> Design Documentation</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: HongpengMa</p>
<p class="date">Created: 2019-05-25 Sat 12:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
